public/blog/windows/cloning-a-bios-boot-drive-to-disimilar-hardware-with-uefi/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <title>Queztaz/Cloning a Bios Boot Drive to Disimilar Hardware with UEFI</title>
  <h1>Cloning a Bios Boot Drive to Disimilar Hardware with UEFI</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Cloning a Bios Boot Drive to Disimilar Hardware with UEFI </a>
<ul>
<li><a href="#headline-2">Preamble </a>
</li>
</ul>
</li>
<li><a href="#headline-3">*Cloning the drive</a>
<ul>
<li><a href="#headline-4">Overview</a>
</li>
<li><a href="#headline-5">Starting the disk clone</a>
</li>
<li><a href="#headline-6">Downloading the Drivers</a>
</li>
<li><a href="#headline-7">Converting the drive to GPT</a>
</li>
<li><a href="#headline-8">Creating the EFI Partition</a>
</li>
<li><a href="#headline-9">Loading the drivers</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Cloning a Bios Boot Drive to Disimilar Hardware with UEFI 
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble 
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Documented steps for cloning a drive to another computer. The source computer is
running an MBR partition table. The target computer is of completely different
hardware and runs UEFI </p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
*Cloning the drive
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Overview
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>I had a clone an old Dell Machine to a new Dell Optiplex SFF 7010. The
problem was the new computer had an NVME drive with storage controller
drivers that weren&#39;t even in the Windows 11 installation media. On top
of that, the original computer was Windows 10 but was BIOS only,
meaning it wouldn&#39;t boot at all on the UEFI only machine.</p>
<p>
These are the steps it took to clone the drive to a new machine.</p>
<ol>
<li>Clone the drive to the internal NVME using Clonezilla (UEFI version)</li>
<li>Repartition the drive to create a 512MB-1GB EFI partition at the
first sector</li>
<li>Boot into the Windows 11 installer and loading the drivers to
detect the cloned drive</li>
<li>Use the Command Prompt to rebuild the EFI files onto the EFI partition</li>
<li>Still in the recovery prompt, load the drivers into the windows
installation using the command prompt and an external flash drive</li>
</ol>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Starting the disk clone
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Use Clonezilla to do a Disk to Disk clone with the source drive
plugged into a hard drive bay. If you have a 2.5&#34; drive you can get
away with a straight USB to SATA adapter.</p>
<ul>
<li><a href="https://clonezilla.org/downloads/download.php?branch=stable">Download Page</a></li>
<li><a href="https://sourceforge.net/projects/clonezilla/files/clonezilla_live_stable/3.1.0-22/clonezilla-live-3.1.0-22-amd64.iso/download?use_mirror=gigenet">Direct Link (source forge)</a></li>
</ul>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Downloading the Drivers
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Download the drivers from the manufaturer support website. Dell
distributes them as exe files, so you&#39;ll have to run the exe files and
then select the option to extract the files to a directory. For other
manufaturers, you may have to use 7ZIP to extract the EXE files and
copy the driver files to a USB drive for later.</p>
<p>
Whenever you boot into the windows recovery environment to run
commands, you have to load the driver for your storage
controller. Click on &#34;Custom Installation&#34; and &#34;Load Driver&#34; to load
the storage driver from your flash drive.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Converting the drive to GPT
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>After the drive is cloned you can either use the MBR2GPT.exe command
line utility to convert the partition table type or use a third party
tool like <a href="https://www.diskpart.com/download-home.html">Aoemi (proprietary freeware)</a>.</p>
<p>
I tried troubleshooting the MBR2GPT a while, but would always get this
error message when attempting the conversion: <code>mbr2gpt cannot find
room for efi</code>. I gave up and used the freeware instead which took 0
time to convert it. I had to remove the NVME drive from the computer
then plug it into my workstation using another NVME to USB
adapter. After that, I opened Aoemi, right clicked the drive, then
clicked &#34;Convert to GPT&#34;.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Creating the EFI Partition
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Either through Aoemi or GPARTED, create a 1GB FAT32 partition on the first sector
of the drive. It should be your first partition.</p>
<p>
Then boot into windows recovery and use bcdboot to rebuild the EFI
files based on the cloned windows installation</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>diskpart
</span></span><span style="display:flex;"><span>list disk
</span></span><span style="display:flex;"><span>select disk 2 (selecting the cloned drive)
</span></span><span style="display:flex;"><span>list part
</span></span><span style="display:flex;"><span>select part 1 (this is the 1GB efi partition)
</span></span><span style="display:flex;"><span>format fs=fat32 quick
</span></span><span style="display:flex;"><span>assign letter=z: (mounting the EFI partition)
</span></span><span style="display:flex;"><span>list vol (double checking the volume of the OS drive...it was E)
</span></span><span style="display:flex;"><span>exit
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>bcdboot E:\Windows /s Z: /f ALL  (restoring efi files)</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Loading the drivers
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>While still booted into the recovery disk, I loaded the drivers from
the USB flash drive to the windows image</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>dism /Image:E:\ /Add-Drivers:D:\ /Recurse</span></span></code></pre></div>
</div>
<p>
After that, you should be able to boot into Windows in UEFI mode!</p>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
